In [1]:
import pandas as pd
import numpy as np

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [4]:
#  없는 데이터의 이름을 주는거라네용~
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [6]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(data=d)

a    10
b    20
c    30
dtype: int64

In [17]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [3]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [5]:
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

In [9]:
w = ['USA','Germany','USSR','japan']
l = [1,2,3,4]

ser1 = pd.Series(l,w)
ser1

USA        1
Germany    2
USSR       3
japan      4
dtype: int64

In [10]:
ser1 = pd.Series([1,2,3,4],index = ['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [14]:
ser1['USA']
# ser1[0] 이것도 같음.

1

In [7]:
from numpy.random import randn
np.random.seed(5)

In [74]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.872655 -0.202118 -0.598360 -0.243420
B  2.088515  0.346919  0.745727  0.776908
C  1.018421  1.061351 -0.710466 -0.215188
D -0.760760 -0.711163  1.141508 -0.501756
E -0.079151 -0.692826 -0.593403  0.788238

## dataframe의 column 불러오기 연습

In [28]:
df['W'] # 테이블 형태가 아님

A   -0.305853
B    0.269612
C   -0.336336
D   -1.310773
E   -0.107164
Name: W, dtype: float64

In [29]:
df[['W']] # 테이블 띠

          W
A -0.305853
B  0.269612
C -0.336336
D -1.310773
E -0.107164

In [30]:
df[['W','Z']]

          W         Z
A -0.305853  0.355438
B  0.269612  0.494440
C -0.336336  0.221254
D -1.310773  1.152205
E -0.107164  0.124807

In [216]:
df = pd.DataFrame(randn(5,5),index='A B C D E'.split(),columns='W X Y Z new'.split())
df

          W         X         Y         Z       new
A -0.688416  0.659193 -0.083602 -0.699513  0.939288
B -0.590417 -0.031351  0.734223  0.943710  1.200160
C  1.656744  0.044983 -0.798176  1.648034  1.391608
D -0.299361  0.701205 -0.377602 -1.557301  1.038176
E  0.346052  0.122382  1.690006  1.432712 -0.641624

In [217]:
df['new'] = df['W']+df['Y']
df

          W         X         Y         Z       new
A -0.688416  0.659193 -0.083602 -0.699513 -0.772018
B -0.590417 -0.031351  0.734223  0.943710  0.143805
C  1.656744  0.044983 -0.798176  1.648034  0.858568
D -0.299361  0.701205 -0.377602 -1.557301 -0.676963
E  0.346052  0.122382  1.690006  1.432712  2.036058

# Pandas의 dataframe을 통해 column 삭제

In [218]:
df.drop('new',axis=1)

          W         X         Y         Z
A -0.688416  0.659193 -0.083602 -0.699513
B -0.590417 -0.031351  0.734223  0.943710
C  1.656744  0.044983 -0.798176  1.648034
D -0.299361  0.701205 -0.377602 -1.557301
E  0.346052  0.122382  1.690006  1.432712

In [219]:
df.drop('new',axis=1,inplace=True)

In [220]:
df

          W         X         Y         Z
A -0.688416  0.659193 -0.083602 -0.699513
B -0.590417 -0.031351  0.734223  0.943710
C  1.656744  0.044983 -0.798176  1.648034
D -0.299361  0.701205 -0.377602 -1.557301
E  0.346052  0.122382  1.690006  1.432712

In [221]:
df.drop('E')

          W         X         Y         Z
A -0.688416  0.659193 -0.083602 -0.699513
B -0.590417 -0.031351  0.734223  0.943710
C  1.656744  0.044983 -0.798176  1.648034
D -0.299361  0.701205 -0.377602 -1.557301

In [222]:
df.drop('E', axis=0)
# Tuple형태, 
# 앞에 5는 row 수, 해당 인덱스는 0
# 뒤에 4는 column수, 해당 인덱스는 1 
# Axis는 축이라는 뜻.
# axis = 0은 없는것과 같기에 생략이 가능해서

          W         X         Y         Z
A -0.688416  0.659193 -0.083602 -0.699513
B -0.590417 -0.031351  0.734223  0.943710
C  1.656744  0.044983 -0.798176  1.648034
D -0.299361  0.701205 -0.377602 -1.557301

In [223]:
df.loc[['A']]

          W         X         Y         Z
A -0.688416  0.659193 -0.083602 -0.699513

In [224]:
df.loc['A']

W   -0.688416
X    0.659193
Y   -0.083602
Z   -0.699513
Name: A, dtype: float64

In [225]:
df.iloc[2]

W    1.656744
X    0.044983
Y   -0.798176
Z    1.648034
Name: C, dtype: float64

In [226]:
df.loc['B'].iloc[2]

0.7342226872647983

In [86]:
df.loc['B','Y']

0.22638929097623853

In [95]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.578196  2.169762
B  0.207067  0.226389

## Dataframe의  conditional selection(조건부 선택)

In [227]:
df>0

       W      X      Y      Z
A  False   True  False  False
B  False  False   True   True
C   True   True  False   True
D  False   True  False  False
E   True   True   True   True

In [228]:
df[df['W']>0]

          W         X         Y         Z
C  1.656744  0.044983 -0.798176  1.648034
E  0.346052  0.122382  1.690006  1.432712

In [232]:
df[df['W']>0][['Y']]

          Y
C -0.798176
E  1.690006

In [235]:
df[df['W']>0][['X','Y']]

          X         Y
C  0.044983 -0.798176
E  0.122382  1.690006

In [236]:
df[df['W']>0]['Y']

C   -0.798176
E    1.690006
Name: Y, dtype: float64

In [278]:
df[(df['W']>0)&(df['Y']>1)]

          W         X         Y         Z
E  0.346052  0.122382  1.690006  1.432712

# More Index Details부터 시작

In [92]:
score1 = [[40,30,60,100],[90,100,20,30],[50,20,90,99],[10,40,100,90]]
df_score = pd.DataFrame(score1, index='John Mary Peter Paul'.split(),columns='Math Science English Coding'.split())
df_score
# pd.DataFrame(data명, index, columns)
# pd.DataFrame(data를 산출하는 함수(사이즈), index, columns)

       Math  Science  English  Coding
John     40       30       60     100
Mary     90      100       20      30
Peter    50       20       90      99
Paul     10       40      100      90

In [93]:
df_score['총점'] = df_score['Math']+df_score['Science']+df_score['English']+df_score['Coding']
df_score
# 총점이라는 컬럼 추가

       Math  Science  English  Coding   총점
John     40       30       60     100  230
Mary     90      100       20      30  240
Peter    50       20       90      99  259
Paul     10       40      100      90  240

In [94]:
df_score.loc['Titus'] = [80,30,60,90,260]
df_score
# 학생이라는 인덱스 추가

       Math  Science  English  Coding   총점
John     40       30       60     100  230
Mary     90      100       20      30  240
Peter    50       20       90      99  259
Paul     10       40      100      90  240
Titus    80       30       60      90  260

In [95]:
df_score['Music'] = [90,30,40,20,10]
df_score

       Math  Science  English  Coding   총점  Music
John     40       30       60     100  230     90
Mary     90      100       20      30  240     30
Peter    50       20       90      99  259     40
Paul     10       40      100      90  240     20
Titus    80       30       60      90  260     10

In [96]:
df_score = df_score[['Math', 'Science', 'English', 'Coding', 'Music', '총점']]
#컬럼명 재정렬을 위해 위 코드가 필요

In [97]:
df_score['총점'] = df_score['Math']+df_score['Science']+df_score['English']+df_score['Coding']+df_score['Music']
df_score

       Math  Science  English  Coding  Music   총점
John     40       30       60     100     90  320
Mary     90      100       20      30     30  270
Peter    50       20       90      99     40  299
Paul     10       40      100      90     20  260
Titus    80       30       60      90     10  270

In [98]:
df_score['평균'] = (df_score['Math']+df_score['Science']+df_score['English']+df_score['Coding']+df_score['Music'])/5
df_score

       Math  Science  English  Coding  Music   총점    평균
John     40       30       60     100     90  320  64.0
Mary     90      100       20      30     30  270  54.0
Peter    50       20       90      99     40  299  59.8
Paul     10       40      100      90     20  260  52.0
Titus    80       30       60      90     10  270  54.0

In [99]:
df_score[(df_score['Coding']>50)&(df_score['Math']>50)]

       Math  Science  English  Coding  Music   총점    평균
Titus    80       30       60      90     10  270  54.0

### & : and, 교집합, 다중의 조건을 모두 만족시킴
### | : or, 합집합, 다중의 조건 중 하나만 만족시켜도 okay

In [100]:
df

               W         X         Y         Z
States
CA      0.872655 -0.202118 -0.598360 -0.243420
NY      2.088515  0.346919  0.745727  0.776908
WY      1.018421  1.061351 -0.710466 -0.215188
OR     -0.760760 -0.711163  1.141508 -0.501756
CO     -0.079151 -0.692826 -0.593403  0.788238

In [101]:
df.reset_index()

  States         W         X         Y         Z
0     CA  0.872655 -0.202118 -0.598360 -0.243420
1     NY  2.088515  0.346919  0.745727  0.776908
2     WY  1.018421  1.061351 -0.710466 -0.215188
3     OR -0.760760 -0.711163  1.141508 -0.501756
4     CO -0.079151 -0.692826 -0.593403  0.788238

In [102]:
df['States'] = ['CA','NY','WY','OR','CO']
df

               W         X         Y         Z States
States
CA      0.872655 -0.202118 -0.598360 -0.243420     CA
NY      2.088515  0.346919  0.745727  0.776908     NY
WY      1.018421  1.061351 -0.710466 -0.215188     WY
OR     -0.760760 -0.711163  1.141508 -0.501756     OR
CO     -0.079151 -0.692826 -0.593403  0.788238     CO

In [103]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.872655 -0.202118 -0.598360 -0.243420
NY      2.088515  0.346919  0.745727  0.776908
WY      1.018421  1.061351 -0.710466 -0.215188
OR     -0.760760 -0.711163  1.141508 -0.501756
CO     -0.079151 -0.692826 -0.593403  0.788238

In [104]:
df.set_index('States',inplace=True)
df
# 다중 인덱스와 인덱스 간의 계층

               W         X         Y         Z
States
CA      0.872655 -0.202118 -0.598360 -0.243420
NY      2.088515  0.346919  0.745727  0.776908
WY      1.018421  1.061351 -0.710466 -0.215188
OR     -0.760760 -0.711163  1.141508 -0.501756
CO     -0.079151 -0.692826 -0.593403  0.788238

In [105]:
# index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [106]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [107]:
inside

[1, 2, 3, 1, 2, 3]

In [108]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [113]:
df = pd.DataFrame(np.random.randn(6,2), index = hier_index, columns=['A','B'])
df

             A         B
G1 1 -1.599699  0.877153
   2 -0.093832 -0.055671
   3 -0.889421 -1.300951
G2 1  1.402167  0.465101
   2 -1.065033  0.390421
   3  0.305600  0.521849

In [118]:
df.loc['G1']

          A         B
1 -1.599699  0.877153
2 -0.093832 -0.055671
3 -0.889421 -1.300951

In [126]:
df.loc['G1'].iloc[0]

A   -1.599699
B    0.877153
Name: 1, dtype: float64

In [128]:
score2 = [[30,60],[100,50],[10,20],[90,80],[44,41],[70,77]]
df_score2 = pd.DataFrame(score2, index = hier_index, columns=['수학','영어'])
df_score2

       수학  영어
G1 1   30  60
   2  100  50
   3   10  20
G2 1   90  80
   2   44  41
   3   70  77

In [151]:
df_score2.loc['G1'].loc[1].iloc[1]

60

In [154]:
df_score2.loc['G2'].loc[2].iloc[0]

44

In [160]:
df_score2.loc['G1'].loc[1]['영어']

60

In [161]:
df_score2.loc['G2'].loc[2]['수학']

44

In [168]:
df_score2.index.names = ['반', '번호']
df_score2

        수학  영어
반  번호
G1 1    30  60
   2   100  50
   3    10  20
G2 1    90  80
   2    44  41
   3    70  77